function setup() {
  createCanvas(600, 400);
  background(120, 160, 200); // 옅은 남색 배경
  
  strokeWeight(0);
  fill(40, 80, 140); // 짙은 남색 하단부
  rect(0, 280, 600, 120);
  
  fill(108, 148, 205); // 배경 패턴
  quad(300, 25, 400, 100, 300, 200, 200, 100);
  quad(500, 25, 600, 100, 500, 200, 400, 100);
  quad(100, 25, 200, 100, 100, 200, 0, 100);
  
  fill(40, 80, 140);
  circle(300, 30, 20); // 떨어지는 메인 물방울
  ellipse(300, 100, 20, 30);
  ellipse(300, 200, 22, 38);
  
  fill(78, 118, 178); // 떨어지는 주변 물방울
  circle(310, 10, 5);
  circle(290, 60, 10);
  circle(300, 70, 5);
  circle(320, 150, 10);
  circle(310, 170, 5);
  
  stroke(255);
  strokeWeight(8);
  point(290, 95);
  point(240, 180);
  point(330, 120);
  point(380, 260);
  
  strokeWeight(0);
  fill(220, 240, 255); // 수면에 부딪힌 물방울
  arc(300, 280, 80, 25, PI, 2 * PI);
  
  fill(255); // arc 주위 조각난 물방울들(하양)
  triangle(240, 212, 242, 273, 272, 258);
  triangle(325, 237, 317, 287, 340, 218);  
  
  fill(200, 220, 240); // arc 주위 조각난 물방울들 (밝)
  triangle(280, 190, 280, 248, 287, 240);
  triangle(300, 238, 318, 207, 314, 257);
  triangle(348, 248, 390, 204, 358, 269);
  
  // arc 아래 동심원 물결
  fill(30, 70, 130); 
  arc(300, 280, 320, 200, 0, PI);  
  fill(78, 118, 178); 
  arc(300, 280, 240, 150, 0, HALF_PI);
  arc(290, 290, 190, 125, HALF_PI, PI);
  fill(108, 148, 205);
  arc(300, 280, 170, 100, 0, PI);
  fill(170, 205, 235); 
  arc(300, 280, 100, 50, HALF_PI, PI);
  arc(310, 290, 50, 25, 0, HALF_PI);
  
  fill(78, 118, 178); // 글리치처럼 네모 표현
  square(80, 320, 10);
  rect(100, 320, 60, 10);
  square(490, 340, 15);
  rect(520, 340, 30, 15);
  fill(108, 148, 205);
  square(380, 360, 10);
  rect(120, 350, 80, 15);
}